# RemoveField Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleDefinition..::..RemoveField Method
ScheduleDefinition Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RemoveField(Int32) | Removes a field. |
| RemoveField(ScheduleFieldId) | Removes a field. |

# See Also
ScheduleDefinition Class
ScheduleDefinition Members
Autodesk.Revit.DB Namespace